data/RANS/Re_tau_1200_Pr_071/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       3996;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1000;
        startFace       4004;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1000;
        startFace       5004;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       6004;
    }
)

// ************************************************************************* //
