data/RANS/Re_tau_1200_Pr_071/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              0.00004;

// Laminar Prandtl number
Pr              0.71;

// Turbulent Prandtl number
Prt             0.85;

// Thermal expansion coefficient
//beta            3e-03;

// Reference temperature
//TRef            300;

// u_tau / u_b from DNS
u_tau           0.0492922;

// ************************************************************************* //
