data/RANS/Re_tau_1200_Pr_071/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       10000;

stopAt          endTime;

endTime         10100;

deltaT          0.1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

cacheTemporaryObjects
(
    kEpsilon:G
);

functions
{
grad
{
type grad;
libs ("libfieldFunctionObjects.so");
field U;
writeControl writeTime;
}
grad
{
type grad;
libs ("libfieldFunctionObjects.so");
field T;
writeControl writeTime;
}
writeCellCentres1
{
    type            writeCellCentres;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
}
turbulenceFields1
{
    // Mandatory entries (unmodifiable)
    type            turbulenceFields;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    field           R;
    writeControl    writeTime;
}
}


// ************************************************************************* //
